In [8]:
import pandas as pd

In [ ]:
# Задание № 1

In [22]:
def count_top3(years):
    list_frames = []
    for year in years:
        file = f'yob{year}.txt'
        frame = pd.read_csv(file, names=['name', 'sex', 'births'])
        frame['year'] = year
        list_frames.append(frame)
    names = pd.concat(list_frames, ignore_index=True)
    return names.groupby('name').aggregate({'births':sum}).sort_values('births', ascending=False)[:3]

In [23]:
table = count_top3([1880])

In [24]:
table

         births
name
John       9701
William    9562
Mary       7092

In [25]:
table = count_top3([1900, 1950, 2000])

In [26]:
table

        births
name
James   111798
John    109593
Robert  101373

In [ ]:
# Задание № 2

In [6]:
def count_dynamics(years):
    list_frames = []
    for year in years:
        file = f'yob{year}.txt'
        frame = pd.read_csv(file, names=['name', 'sex', 'births'])
        frame['year'] = year
        list_frames.append(frame)
    names = pd.concat(list_frames, ignore_index=True)
    new_table = names.pivot_table('births', index=['sex', 'year'], aggfunc='sum')
    return new_table.unstack('year')

In [7]:
count_dynamics([1900, 1950, 2000])

      births
year    1900     1950     2000
sex
F     299800  1713151  1815110
M     150483  1790549  1962969